app/models/user.rb

  def self.find_for_github_oauth(auth, signed_in_resource=nil)
    user = User.find_by(provider: auth.provider, uid: auth.uid)

    unless user
      user = User.new(provider: auth.provider,
                      uid:      auth.uid,
                      name:     auth.info.name,
                      email:    User.dummy_email(auth),
                      password: Devise.friendly_token[0, 20]
      )
    end
    user.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`provider` = 'github' AND `users`.`uid` = '44428053' LIMIT 1
INSERT INTO `users` (`name`, `email`, `encrypted_password`, `provider`, `uid`, `created_at`, `updated_at`) VALUES ('taiga39', '44428053-github@example.com', '$2a$11$Jchs1wSPCwNQtfr84jyI6O6yW8cd4WosZc11az8ydOeyIQtBUoHe6', 'github', '44428053', '2019-05-01 14:06:32', '2019-05-01 14:06:32')